rpc_examples/011_upload.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
  <SOAP-ENV:Header>
    <cwmp:ID SOAP-ENV:mustUnderstand="1">100</cwmp:ID>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <cwmp:Upload xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <CommandKey></CommandKey>
    <FileType>1 Vendor Configuration File</FileType>
    <URL>http://127.0.0.1/config</URL>
    <Username></Username>
    <Password></Password>
    <DelaySeconds>0</DelaySeconds>
  </cwmp:Upload>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
